Tobias0110/STM32_RF_modulator/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2020 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#define ARM_MATH_CM3
#include "arm_math.h"
#define _USE_MATH_DEFINES
#include <math.h>
#include <string.h>

#define PHASE_RES 58968
#define MAX_F 60000 //Max SSB frequency offset
#define PHASE_RES_2 31

//Macros
#define GPIOB_PIN(n) (*(PERIPH_BB_BASE + (GPIOB->ODR - PERIPH_BASE) * 0x20 + n * 4)) //Bit banding
#define toQ31 2147483648*
#define mulQ31( a, b ) ((int32_t)(( ((int64_t) (a)) * ((int64_t) (b)) ) >> 31 ))
#define rW( n ) w[(pos- n)&0xF]
#define fromQ31( v ) (((float)v) / 2147483648 )
#define PIQ31 ((int32_t) toQ31(PI))
#define sgnCompQ31( a, b ) ( ((a >> 31) & 0x1) == ((b >> 31) & 0x1) )
#define divQ31( a, b ) ((int32_t)( sgnCompQ31(a, b) ? ( ((((int64_t)a) << 31) + (b>>1)) / b ) : ( ((((int64_t)a) << 31) - (b>>1)) / b ) ))
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM2_Init(void);
                                    
void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
volatile uint8_t new_sample = 0, carrier = 0;  //new_sample: tells the main programm if there is a new sample to process
volatile static int16_t adc_value = 0, amplitude = 0; //in and outputs
volatile int32_t dif = 0;
volatile static int32_t offset;
volatile static uint8_t phase_reg;
volatile static uint32_t freq = 36000000; //TX/RX Frequency

static void lcd_write(uint8_t data, uint8_t RS)
{
	uint8_t i;
	
	GPIOB->ODR &= 0x005F; //Clear all Bits
	GPIOB->ODR |= RS << 7; //Set RS
	GPIOB->ODR |= 1 << 5; //Set E to high
	GPIOB->ODR |= data << 8; //Output data
	for(i=0;i<255;i++); //Delay
	GPIOB->ODR &= ~(1 << 5); //Set E to low
	for(i=0;i<255;i++); //Delay
}

static void lcd_init()
{
	HAL_Delay(15);
	lcd_write(0x30, 0);
	HAL_Delay(5);
	lcd_write(0x30, 0);
	HAL_Delay(1);
	lcd_write(0x30, 0);
	//Select Mode (cursor increment, position fix)
	lcd_write(0x06, 0);
	HAL_Delay(1);
	//Display on, cursor off
	lcd_write(0x0C, 0);
	//lcd_write(0x0F, 0);
	HAL_Delay(5);
	//move cursor to the rigth
	lcd_write(0x14, 0);
	HAL_Delay(5);
	//8bit, two lines, 5x7 Font
	lcd_write(0x38, 0);
	HAL_Delay(5);
}

static void lcd_write_string(char data[], uint8_t line)
{
	uint8_t i = 0;
	
	//Clear Display
	if(line == 0) lcd_write(0x80, 0);
	else lcd_write(0xC0, 0);
	//HAL_Delay(1);
	while(data[i] != 0)
	{
		lcd_write((uint8_t) data[i], 1);
		i++;
		
	}
}

static void update_smeter(uint8_t s_value, uint8_t mod)
{
	char out[17], buffer[5];
	uint8_t i;
	
	out[0] = 'S';
	for(i=1; i<=9; i++) //S-Meter Graph
	{
		if(i <= s_value) out[i] = '>';
		else out[i] = ' ';
	}
	out[10] = 0x0;
	if(s_value < 10)
	{
		sprintf(buffer, "%d ", s_value);
		strcat(out, buffer);
	}
	else 
	{
		out[10] = '9';
		out[11] = '+';
	}
	out[12] = 0x0;
	
	if(mod == 5) strcat(out, " NFM");
	else if(mod == 3) strcat(out, " USB");
	else if(mod == 4) strcat(out, " LSB");
	
	lcd_write_string(out, 1);
}

static void update_freq(uint8_t tx)
{
	char out[17], buffer[16];
	uint8_t len, i;
	
	sprintf(out, "%d", freq);
	len = strlen(out);
	for(i=0;i<=(8-len); i++) buffer[i] = '0'; //Add 0 to get constant string size
	buffer[i++] = 0;
	strcat(buffer, out);
	
	//Add points
	for(i=0;i<=1;i++) out[i] = buffer[i];
	out[2] = '.';
	for(i=3;i<=5;i++) out[i] = buffer[i-1];
	out[6] = '.';
	for(i=7;i<=9;i++) out[i] = buffer[i-2];
	out[10] = ',';
	out[11] = buffer[8];
	out[12] = 'H';
	out[13] = 'z';
	out[14] = ' ';
	if(tx == 1) out[15] = '!';
	else out[15] = ' ';
	out[16] = 0;
	
	lcd_write_string(out, 0);
}

inline static void set_ad9850_freq(uint64_t freq_buf, uint8_t pw_d, uint8_t phase_reg_in) //freq in * 0,1 Hz (dezi Hz)
{
	static uint8_t w[5], i;
	static const uint64_t ref = 1250000000;
	static uint64_t w_erg;
	
	w_erg = freq_buf * 4294967296 / ref;  //calculate the 32bit frequency register word for the AD9850
	
	//w_erg = 0xFF00FF00; //Test
	
	w[0] = ((phase_reg_in << 1) | (~pw_d & 0x01)) << 2; //allowes to turn of the carrier
	w[1] = (w_erg >> 24) & 0xFF;
	w[2] = (w_erg >> 16) & 0xFF;
	w[3] = (w_erg >> 8) & 0xFF;
	w[4] = w_erg & 0xFF;
	
	//Set FQ_UD to low
	GPIOC->ODR &= ~(0x01 << 8);
	
