Tobias0110/STM32_RF_modulator/Src/main.c
	for(i=0;i<=4;i++)
	{
		GPIOC->ODR &= ~0xFF;
		GPIOC->ODR |= w[i];
		GPIOC->ODR |= 0x01 << 9; //W_CLK high
		GPIOC->ODR &= ~(0x01 << 9);  //W_CLK low
	}
	
	//Set FQ_UD to high
	GPIOC->ODR |= 0x01 << 8;
	
}
//I do not plan on implementing AM modulation (makes the transmitter simpler and cheaper)
__forceinline static void bc_am()  //broadcast quality AM. Uses max. sample rate while optaining 12 bit PWM range.
{
	//DC Removal variables
	volatile static float w_dc = 0, w_dc1 = 0;
	static const float a_dc = 0.99;

	//Remove DC
	w_dc = (adc_value >> 3) + a_dc * w_dc1;
	amplitude = ((int) (w_dc - w_dc1)) + 2048; //Add DC offset for carrier (2^12 / 2 = 2048)
	w_dc1 = w_dc;
	new_sample = 0;
}

__forceinline int32_t max( int32_t a, int32_t b ) { return a > b ? a : b;  }

__forceinline int32_t min( int32_t a, int32_t b ) { return a < b ? a : b;  }

__forceinline int32_t abs( int32_t a ) { return a < 0 ? (0 -a) : a; }

__forceinline int32_t atan2q31( int32_t a, int32_t b ) {
    //int32_t x= divQ31( a, b );

    int64_t d= ((int64_t)a) << 31;
    if( sgnCompQ31(a, b) ) {
        d+= (b>>1);
    } else {
        d-= (b>>1);
    }
    int32_t x= (d / (int64_t)b);

    // (PI / 4) * x + 0.285 * x * (1 - |x|);
    return mulQ31( (PIQ31 / 4), x ) + mulQ31( toQ31(57 / 200), mulQ31(x, (x- abs(x) ) ) );
}

__forceinline static void ssb(uint8_t lsb)
{
	//DC Removal variables
	volatile static float w_dc = 0, w_dc1 = 0;
	static const float a_dc = 0.99;
	int16_t hilbert_input_i;
	static q31_t hilbert_input;

	//Hilbert-Filter variables
	static q31_t w[16], y_I = 0, y_Q = 0;
	static q31_t amplitude_q;
	static const q31_t a[4] = {toQ31(0.052981), toQ31(0.088199), toQ31(0.18683), toQ31(0.62783)};  //calculated with octave
	static uint8_t pos = 0; //ringbuffer position
	static const q31_t div = toQ31(0.5);
	
	//Phase to Frquency variables
	static float  phase;
	static int32_t prev_phase;
	static int32_t phase_i = 0, prev_phase_i = 0;
	
	//will be implemented in q31 in the future
	/*w_dc = adc_value + a_dc * w_dc1;
	hilbert_input_i = (int) (w_dc - w_dc1);
	w_dc1 = w_dc;
	
	hilbert_input = mulQ31((hilbert_input_i * ( toQ31(1) / 2048 )), div);*/
	
	static q31_t adc_value_q, wdc_q, wdc1_q;
	static const q31_t adc_q = toQ31(0.99);
	
	adc_value_q = adc_value * ( toQ31(1) / 2048 );
	adc_value_q = adc_value_q >> 10;  //Avoids overflow
	wdc_q = adc_value_q + mulQ31(adc_q,  wdc1_q);
	hilbert_input = wdc_q - wdc1_q;
	wdc1_q = wdc_q;
	
	hilbert_input = hilbert_input << 7; //More resulution for the hilbert transformer

	w[++pos & 0x0F] = hilbert_input;
	y_I = rW(7);
	//structure optimation inspired by wikipedia: Hilbert-Transformation
	//Designed with Octave
	y_Q = mulQ31(rW(14) - rW(0), a[0]) +
        mulQ31(rW(12) - rW(2), a[1]) +
        mulQ31(rW(10) - rW(4), a[2]) +
        mulQ31(rW(8) - rW(6), a[3]);
				
//++++++++THE FOLLOWING PART IS UNDER CONSTRUCTION++++++++
	
	//Komponentenschreibweise zu Winkelschreibweise (Component notation to Angular notation?)
	//arm_sqrt_q31(mulQ31(mulQ31(y_I, y_I), div) + mulQ31(mulQ31(y_Q, y_Q), div), &amplitude_q);
	amplitude_q = mulQ31(mulQ31(y_I, y_I), div) + mulQ31(mulQ31(y_Q, y_Q), div); //is sufficient for detecting 0
	//amplitude = (uint16_t) mulQ31( amplitude_q, (q31_t) toQ31( 4096 / toQ31(1))); //Not tested
	
	static q31_t phase_q;
	
		phase_q = toQ31(atan2f(fromQ31(y_Q), fromQ31(y_I)) / PI); //[-1 1]
		//phase = phase / 2;
		phase_q = phase_q >> 1;
		//if(phase < 0) phase = 1 + phase; //convert negativ phase to positiv phase (atan2f returns a value between -pi and +pi)
		if(phase_q < 0) phase_q = toQ31(1) + phase_q;
		//phase = (phase / (2 * PI)) * PHASE_RES; //PHASE_RES is the phase resulution (importent when converting to int)
		//phase = fromQ31(phase_q) * PHASE_RES;
		phase_i = (((phase_q >> 16) * PHASE_RES) >> 15);

	if(y_I == 0) phase_i = 0;
	
	//The differential of a phase gives the frequency change (you can convert a frequency modulator into a phase modulator)
	/*dif = (int) phase - prev_phase;
	prev_phase = (int) phase;*/
	
	dif = phase_i - prev_phase_i;
	prev_phase_i = phase_i;
	
	//a "circular" nummber set is needed
	if(dif < 0) dif = dif + PHASE_RES; //avoid negativ phase differences (and therefore negative frequencies)
	
	/*if(dif > MAX_F) //Reducing the bandwidth while maintaining the required frequency shift (delaying to the next sample)
	{
		prev_phase = phase - (dif - MAX_F);
		dif = MAX_F;
	}*/
	
	offset = dif;
	
	carrier = 1;
	if(amplitude_q == 0) carrier = 0; //no carrier when there is no audio input and thus no amplitude
	
	//LSB
	if(lsb == 1) offset = offset * -1; //mirror the frequencies on the carrier.
	
	//DDS Phase Reg
	phase_reg = 0;
	
	new_sample = 0; //calculation finished
	
//++++++++END OF CONSTRUCTION AREA++++++++
}

__forceinline static void nfm(uint8_t comp)
{
	//DC Removal variables
	static float w_dc = 0, w_dc1 = 0;
	static const float a_dc = 0.3;
	static float out_dc;
	
	static int16_t gain = 0;
	static uint16_t to_high = 0, to_low = 0;
	
	//DC blocking filter (IIR Filter) and Preemphasis Filter
	w_dc = adc_value + a_dc * w_dc1;
	out_dc = (w_dc - w_dc1);
	w_dc1 = w_dc;
	
	if(comp == 0) gain = 0; //Deactivates the compressor
	offset = (int32_t) (out_dc * (50 + gain));
	
	//Compressor
	if(offset > 50000) //Limmit frequency drift
	{
		offset = 50000;
		to_high++;
	}
	if(offset < -50000) //Limmit frequency drift
	{
		offset = -50000;
		to_high++;
	}
	
	if(to_high > 0) //Release
	{
		gain--;
		to_high--;
	}
	else if (offset > 100) //avoid triggering on silence
	{
		to_low++;
		if(to_low > 5) //Attack
		{
			gain++;
			to_low = 0;
		}
	}
	
	carrier = 1;
	new_sample = 0; //calculation finished
}

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	uint8_t mod = 3; //1 = AM; 3 = USB; 4 = LSB; 5 = NFM
	uint8_t tx = 0, tx_prev = 0;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

